app/controllers/my_devise/registrations_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "encrypted_password", "device_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    client = Round.client
    client.authenticate_identify(api_token: ENV['ROUND_API_TOKEN'])
    params[:user][:device_token] = client.users.create(
      first_name: params[:user][:first_name],
      last_name: params[:user][:last_name],
      email: params[:user][:email],
      passphrase: params[:user][:passphrase],
      device_name: "device#{rand(99999)}",
      redirect_uri: 'https://bitflash.herokuapp.com'
    )