app/controllers/btcaddresses_controller.rb

  def index
    @btcaddresses = current_user.btcaddresses.order(created_at: :desc).page params[:page]
---
SELECT "btcaddresses".* FROM "btcaddresses" WHERE "btcaddresses"."user_id" = $1  ORDER BY "btcaddresses"."created_at" DESC  [["user_id", 3]]

  def create
    new_address = current_user.btcaddresses.new(
      address: current_user.create_new_address
    )
---
INSERT INTO "btcaddresses" ("address", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["address", "33Xa4gyPzB6eoDifGHFhPmk5ygAzeKY4sM"], ["user_id", 3], ["created_at", "2015-07-16 18:18:02.891051"], ["updated_at", "2015-07-16 18:18:02.891051"]]