app/controllers/friendships_controller.rb

  def index
    unless params[:search].empty?
      @search_result = User.where("email LIKE ?", "%#{params[:search]}%").first
---
SELECT  "users".* FROM "users" WHERE (email like '%xlive4honorx@gmail.com%')  ORDER BY "users"."id" ASC LIMIT 1

  def create
    @friendship = current_user.friendships.build(friend_id: params[:friend_id])
    if @friendship.save
---
INSERT INTO "friendships" ("friend_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["friend_id", 3], ["user_id", 3], ["created_at", "2015-06-23 22:44:40.772594"], ["updated_at", "2015-06-23 22:44:40.772594"]]

  def destroy
    @friendship = current_user.friendships.find(params[:id])
    @friendship.destroy
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."id" = $2 LIMIT 1  [["user_id", 3], ["id", 5]]
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 5]]