app/controllers/friendships_controller.rb

  def create
    friend = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE (email LIKE '%xlive4honorx@gmail.com%')  ORDER BY "users"."id" ASC LIMIT 1