app/controllers/homes_controller.rb

SELECT  "btcaddresses".* FROM "btcaddresses" WHERE "btcaddresses"."user_id" = $1  ORDER BY "btcaddresses"."id" ASC LIMIT 1  [["user_id", 3]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1  [["user_id", 3]]
---
  def index
    binding.pry
    if user_signed_in? && current_user.btcaddresses.empty?
      current_user.btcaddresses.create(
        address: current_user.create_new_address
      )
    end
  rescue
    @friendships = current_user.friendships.page params[:page]