app/controllers/transactions_controller.rb

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT 1  [["id", 2]]
---
  def new
    binding.pry
    @friendship = Friendship.find(params[:friendship_id])

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."user_id" = $1  ORDER BY "addresses"."id" ASC LIMIT 1  [["user_id", 3]]
SELECT  "btcaddresses".* FROM "btcaddresses" WHERE "btcaddresses"."user_id" = $1  ORDER BY "btcaddresses"."id" ASC LIMIT 1  [["user_id", 3]]
SELECT  "btcaddresses".* FROM "btcaddresses" WHERE "btcaddresses"."id" = $1 LIMIT 1  [["id", 3]]
INSERT INTO "transactions" ("amount", "sender_address_id", "recipient_address_id", "friendship_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["amount", 37000], ["sender_address_id", 2], ["recipient_address_id", 3], ["friendship_id", 38], ["created_at", "2015-07-19 00:43:31.762315"], ["updated_at", "2015-07-19 00:43:31.762315"]]
---
  def create
    @friendship = Friendship.find(params[:friendship_id])
    params[:transaction][:sender_address_id] = current_user.btcaddresses.first.id
    params[:transaction][:recipient_address_id] = @friendship.friend.btcaddresses.first.id
    friend_address = Btcaddress.find(params[:transaction][:recipient_address_id]).address
    amount = params[:transaction][:amount]
    passphrase = params[:transaction][:passphrase]
    new_transaction = current_user.make_btc_payment(passphrase, friend_address, amount)
    if new_transaction.mfa_uri
      @friendship.transactions.create(transaction_params)