app/views/transactions/index.html.erb

          <td><%= transaction.user_id == current_user.id ? "Outgoing" : "Incoming" %></td>
          <td><%= transaction.user_id == current_user.id ? Btcaddress.find(transaction.recipient_address_id).address : Btcaddress.find(transaction.sender_address_id).address %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]